cf/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>(Общ) Расчетная ставка НДС 20% / 120%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС19</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС19_119</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>(Общ) Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>(Общ) Расчетная ставка НДС 18% / 118%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>(Общ) Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>(Общ) Расчетная ставка НДС 10% / 110%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/СтавкиНДС/Ext/ManagerModule.bsl
Функция ПолучитьЧислоСтавкиНДС(Ссылка) Экспорт
	
	Если Ссылка = Перечисления.СтавкиНДС.НДС18 ИЛИ Ссылка = Перечисления.СтавкиНДС.НДС18_118 Тогда
		
		Возврат 18;
		
	ИначеЕсли Ссылка = Перечисления.СтавкиНДС.НДС19 ИЛИ Ссылка = Перечисления.СтавкиНДС.НДС19 Тогда
		
		Возврат 19;
		
	ИначеЕсли Ссылка = Перечисления.СтавкиНДС.НДС10 ИЛИ Ссылка = Перечисления.СтавкиНДС.НДС10_110 Тогда
		
		Возврат 10;
				
	ИначеЕсли Ссылка = Перечисления.СтавкиНДС.НДС20 ИЛИ Ссылка = Перечисления.СтавкиНДС.НДС20_120 Тогда
			
		Возврат 20;
		
	Иначе 
		
		Возврат 0; КонецЕсли;
	
КонецФункции
